[{"model": "core.destination", "pk": 1, "fields": {"name": "Alula", "summary": "AlUla, with its rich details, is a historical mine people seek from all over the world.  On its land cultures met, and many civilizations were built, especially at Hegra, the first Saudi site to enter the UNESCO World Heritage List. In its historical landmarks, you will discover hidden stories, as its rocks are full of obscure symbols, exquisite inscriptions and texts leading back to the first century BC.  Its land still uncovers one secret after another leading us to new historical deductions every day. Its inhabitants welcome you with smiles and joy, coming from the generosity of the Arab culture.  The restaurants here offer your tastebuds a special experience, surprising you with a combination of innovative dishes in front of amazing views. . Its unique terrain gives you the chance of living exceptional experiences such as rock climbing, hiking, and camping in the beautiful desert under a starry sky, in addition to seasonal events and musical and cultural activities combining", "published_at": "2024-03-21T19:14:00.152Z", "image": "destinations/imgdestination_1.jpg", "slug": "alula"}}, {"model": "core.destination", "pk": 2, "fields": {"name": "Riyadh", "summary": "In the ever-growing and flourishing city of Riyadh, you will discover the birthplace of the Kingdom of Saudi Arabia, along with its historical treasures hidden in the old palaces that witnessed the founding of the kingdom. It is a destination for tourists from all over the globe who wish to discover a world of shopping, entertainment and business. The malls offer the most exciting shopping experience, and the sand dunes combined with the brightest stars in the sky present the most magical experience in nature. It is an environment full of a natural variety and unique characteristics that are intriguing for explorers. On the other side of the bustling city, you can enjoy a variety of experiences in luxurious restaurants that offer their special services, and their elaborate international dishes.", "published_at": "2024-03-07T17:24:20.027Z", "image": "destinations/imgdestination_None_gJdKOGC.jpg", "slug": "riyadh"}}, {"model": "core.destination", "pk": 3, "fields": {"name": "Jeddah", "summary": "When you visit Jeddah, you will have the opportunity to witness a rich heritage celebrated by UNESCO. From Historical Jeddah to the antique designs of balconies, stone walkways and ancient sidewalks, this destination unearths secrets that have inspired artists, writers and visitors alike for hundreds of years. Here, you will have a chance to see magnificent sunsets shimmering off the divine Red Sea shores as well as having magical diving experiences featuring colorful coral reefs. Whether on land or under the sea, you wont soon forget Jeddahs many year-round splendors.", "published_at": "2024-03-07T17:25:17.941Z", "image": "destinations/imgdestination_None_2RprKJS.jpg", "slug": "jeddah"}}, {"model": "core.destination", "pk": 4, "fields": {"name": "Taif", "summary": "The Mountainous City and its Rural Nature\r\nLike any mountainous city, Taif is embedded in clouds. It offers a tranquil setting and pleasure characterized by magnificence and purity. Taif, the friend of the clouds, characterized by the cool weather, is located on the eastern slopes of the Sarawat Mountains and about 1,700 m above sea level. It increases in height as you head towards its southern rural areas, reaching a height of 2,400 m, where you find its rich farms and lively traditions.\r\nHere we recommend the most amazing events that can be organized among its mountains and fields. In the guide, we include its most popular and beautiful areas.", "published_at": "2024-03-07T17:26:14.669Z", "image": "destinations/imgdestination_None.png", "slug": "taif"}}, {"model": "core.destination", "pk": 5, "fields": {"name": "Makkah", "summary": "The Site of Islams Revelation and the Qiblah (Prayer Direction) of Muslims\r\nIn the past, it was called Bakkah, Umm Al-Qura, and Al-Balad Al-Amin, and its mountains witnessed the first revelation.  Its visitors stand in amazement in front of the honorable Kaaba, the qiblah of Muslims from all over the world, in the middle of Masjid Al-Haram with its majestic view, surrounded by thousands of worshipers all the time. Makkah welcomes millions of Muslims who go to Hajj or Umrah.  It is the purest spot on Earth, and the holiest Islamic destination in the world, and it includes historical destinations that reveal immortal stories that left their mark in Islamic history.  It was also an important commercial station for mobile trade caravans between the north and south, and an area rich in literary forums, and seasonal markets that highlighted its cultural and commercial status. Makkah receives guests from all over the world but entry to the Haram area is for Muslims only.", "published_at": "2024-03-07T17:27:06.310Z", "image": "destinations/imgdestination_None.jpeg", "slug": "makkah"}}, {"model": "core.destination", "pk": 6, "fields": {"name": "Jouf", "summary": "Jouf is home to olive trees and is known for the fertility of its land and the suitability of its climate for producing the finest crops, such as olives, dates, grains, fruits, and vegetables. The region has a rich history dating back millions of years. It contains historical sites from the Stone Age and even earlier, as well as palaces and ancient castles that preserve their old appearance, taking visitors on a journey through time. Jouf offers many options for outdoor entertainment, with stunning geological features such as fresh groundwater wells, mountains, deserts, and plains. The region is also one of the best sources of non-oil energy due to its flat land, which allows for the capture of solar energy. Jouf is adorned with seasonal festivals that provide glimpses into the rich identity of the area, as well as several tourist destinations, including green parks, activity-rich shopping centers, and modern and traditional restaurants offering delicious cuisine.", "published_at": "2024-03-07T17:36:35.280Z", "image": "destinations/imgdestination_None_zNiOAHm.jpg", "slug": "jouf"}}, {"model": "core.destination", "pk": 7, "fields": {"name": "Al-Qassim", "summary": "A land that poets wrote about and that supplies over 74 countries with the finest dates.  Its goods include vegetables, grains, and dates, making it a special location for trade and agriculture. It produces over a million tons of crops annually and crowns its harvest season with Buraidah Date Festival. Al-Qassim Province captivates the hearts of visitors with its cultural heritage, historical landmarks, and beautiful nature.  It is located within the Najd Highland which includes Riyadh, Al-Qassim, and Hail.  Wadi al-Rummah crosses Al-Qassim from East to West and is the longest valley in the Arabian Peninsula.It also includes many places that are mentioned by poets, such as Uyun AlJiwa which witnessed the love story of one of the most important Arab poets, Antarah ibn Shaddad, and Jabal Rama wa Ramtan in Al Badayea City which were mentioned by the poet Zuhayr ibn Abi Sulma.", "published_at": "2024-03-21T18:05:28.313Z", "image": "destinations/imgdestination_None_blmiPVo.jpg", "slug": "al-qassim"}}, {"model": "core.destination", "pk": 8, "fields": {"name": "Tabuk", "summary": "The sky of Tabuk Province resounds with traditional arts mixed with the melodies of the rababa and sung poems. Some of the province's archaeological sites date back 500 years BC and are filled with timeless historical stories. Tabuk was an ancient trading route due to its location in the northwestern part of the Arabian Peninsula, and its fertile land produces crops that compete in global markets, such as fruits, vegetables, wheat, and barley, in addition to millions of roses that color the city's farms. Its inhabitants are renowned for their local industries, such as upholstery, tents, boats, and swords. The Tabuk cuisine offers a rich cultural blend due to its proximity to the Levant. Its stunning geography offers diverse experiences, living on golden beaches, a barren desert, towering mountains, and springs that have been flowing for hundreds of years.", "published_at": "2024-03-21T19:04:53.247Z", "image": "destinations/imgdestination_None_EWG8T5q.jpg", "slug": "tabuk"}}, {"model": "core.destination", "pk": 9, "fields": {"name": "Al Madinah", "summary": "Historically known as Yathrib, Al Madinah was established in the 6th century B.C. It is celebrated as the place where Muhammad established the Muslim community. Al Madinah is steeped in Islamic heritage, and it is home to the Quba Mosque (the first mosque built in Islam) as well as the Prophets Mosque, which is considered to be the second-holiest mosque after Makkahs Grand Mosque. Yathrib came to prominence centuries ago because of its location; it sits among various trade routes and has unique geographical features, including mountains, plains, oases, and gold, silver and copper mines. Al Madinah receives millions of Muslims from all around the world on their religious journeys each year, though both Muslims and non-Muslims are free to explore Al Madinahs many attractions.", "published_at": "2024-03-21T19:06:47.213Z", "image": "destinations/imgdestination_None_FNchSWS.jpg", "slug": "al-madinah"}}, {"model": "core.destination", "pk": 10, "fields": {"name": "Hail", "summary": "Hail, also known as the Key to the Desert and the Bride of the North, is renowned for its authentic generosity because Hatim Al-Tai, renowned across the Middle East and South Asia for his extreme generosity, resided there a long time ago. Hail is a region with a history that extends back to prehistoric times, rich in diverse terrains, from vast deserts to plains, valleys, and rocky areas, as well as a series of mountains, including Aja and Salma. Due to its important strategic location, it was a crossing point for pilgrims from the north of the Kingdom. Hail is home to landmarks dating back to the Stone Age, as well as two UNESCO World Heritage Sites. The first site is Jabal Umm Sanman in Jubbah, located 100 kilometers northwest of Hail City. It contains over 5,000 rock art engravings and inscriptions dating back to the 7th millennium BC and is a tourist destination that attracts heritage, rock art, and archeology enthusiasts.", "published_at": "2024-03-21T19:08:10.686Z", "image": "destinations/imgdestination_None_wbk0StA.jpg", "slug": "hail"}}, {"model": "core.destination", "pk": 11, "fields": {"name": "Yanbu", "summary": "Yanbu is the capital of diving in Saudi Arabia and one of the most amazing cities on the West Coast.  Three sections intervene in Yanbu forming small amazing independent cities which are Yanbu Al Bahr, Yanbu Al Nakhal, and Yanbu Industrial, each of which has its own captivating details. Yanbu Al Nakhal has a rich history as it was a resting point for convoys between Saudi Arabia, Egypt, Yemen, and the Mediterranean Sea.  Yanbu Industrial, on the other hand, has oil facilities and Yanbu Industrial Lake which is similar to a natural oasis. Yanbu Al Bahr is in the heart of the city and holds beautiful archaeological buildings made of mud and stones, and historical sites going back hundreds of years, such as Souq Al Layl, Senussi Mosque, handicraft shops, and folk restaurants serving local dishes with original flavours.", "published_at": "2024-03-21T19:09:36.330Z", "image": "destinations/imgdestination_None_aXeJknR.jpg", "slug": "yanbu"}}, {"model": "core.destination", "pk": 12, "fields": {"name": "Dammam", "summary": "Dammam possesses the qualities of scarcity, originality and wealth, which made it the pearl of the Arabian Gulf. Its strategic location in the eastern region is of great importance to the economy of Saudi Arabia, as it includes the first oil well that produced promising commercial quantities that allowed Saudi Arabia to lead the scene of global oil markets to this day. The well was named \"Al-Khair Well,\" aka Dammam Well No. 7.\r\nThe city combines renewed modern destinations and originality in its local markets adorned with exquisite traditional crafts, such as weaving, pottery and wicker making.", "published_at": "2024-03-21T19:10:34.649Z", "image": "destinations/imgdestination_None_lML507t.jpg", "slug": "dammam"}}, {"model": "core.destination", "pk": 13, "fields": {"name": "Al-Ahsa", "summary": "You will fall in love with Al-Ahsa from the first visit. You will find a warm welcome from the locals, with their distinctive accent and originality that shows in the mastery of exquisite products. Al-Ahsa people inherited handicrafts and live in a natural environment characterized by fertile land and varied industry. It has enjoyed an important commercial position since the year 960 AD, as it was a gateway to communication with the countries of the world and a meeting place for various civilizations through the port of Al-Uqair, which is the most important historical destination in the city. It also has many archaeological sites, including the Al-Ahsa Oasis, which is inscribed in the UNESCO World Cultural Heritage List.", "published_at": "2024-03-21T19:11:17.855Z", "image": "destinations/imgdestination_None_WRAXXt2.jpg", "slug": "al-ahsa"}}, {"model": "core.destination", "pk": 14, "fields": {"name": "Diriyah", "summary": "In Diriyah, you will be introduced to a distinct dimension of entertainment, which is the heart of a historical city that was established in 1446 AD. It takes you back to the ancient history of the Kingdom of Saudi Arabia through its old streets, heritage landmarks and unique natural components. It is strategically located on the banks of Wadi Hanifah, northwest of Riyadh, to be a world-class cultural suburb. It holds museums in its old buildings to give you a glimpse into the past. Diriyah has gained a historical and heritage status, and in 2010, At-Turaif District was registered as a UNESCO World Heritage site. From the diverse nature to the stunning architecture, visitors go to Diriyah to spend a great time in its parks, where there are seasonal events, folk performances, markets and restaurants with an authentic traditional style.", "published_at": "2024-03-21T19:15:08.239Z", "image": "destinations/imgdestination_None_iF5m1vz.jpg", "slug": "diriyah"}}, {"model": "core.destination", "pk": 15, "fields": {"name": "KAEC", "summary": "Located on the shores of the Red Sea and spanning an area of 181 million square meters, King Abdullah Economic City is one of the most important economic cities in the world. The city boasts a modern lifestyle, destinations that encourage tranquility and relaxation, and modern living details. It is one of the newest cities in Saudi Arabia, established in 2005 by King Abdullah bin Abdulaziz Al Saud and has become one of the most important entertainment destinations visited by millions of visitors. The city is covered with green spaces and features King Abdullah Port, the fastest-growing port in the world, as well as family-friendly activities such as luxurious resorts, locally styled accommodations, and water activities on stunning beaches. Additionally, the city's beautiful marine facade offers an exceptional experience that blends captivating natural components.", "published_at": "2024-03-21T19:16:15.460Z", "image": "destinations/imgdestination_None_kyPTw5n.jpg", "slug": "kaec"}}, {"model": "core.destination", "pk": 16, "fields": {"name": "Al-Baha", "summary": "Al-Baha Province is filled with dense forests, mountains, and waterfalls, along with captivating valleys. The province also holds a rich history, evident in the engravings and drawings left on its mountains and valleys, as well as a heritage full of ancient traditions, reflected in its traditional dishes, historical villages, heritage museums, and popular markets that showcase the details of the past. Its fertile lands produce several crops, including vegetables, grains, and seasonal fruits such as grapes, pomegranates, apples, peaches, and prickly pears. The delicious taste of Al-Baha's honey reflects the quality and authenticity of local production. Visitors can taste and purchase honey as part of the experiences that the region offers. It is one of the most important honey-producing regions in Saudi Arabia, where its locals have been keeping bees for hundreds of years.", "published_at": "2024-03-21T19:17:15.126Z", "image": "destinations/imgdestination_None_sVqt3gd.jpg", "slug": "al-baha"}}, {"model": "core.destination", "pk": 17, "fields": {"name": "Abha", "summary": "At an altitude of 2,200 m between the peaks of the Sarawat Mountains, Abha, is ideally located in southwestern region of Saudi Arabia. Its exceptional location allows you to embrace the clouds and wonder around its mountaintops. While consumed with astonishment and amusement, you will feel like time traveling hundreds of years back in time as you stumble upon castles and palaces built from the elements taken from their unspoiled environment.   Making your way through the fog, even in summertime, you will easily find its plains and cliffs and its rich diversity. You will get a chance to learn closely about the artistic community, and how, hundreds of years ago, women extracted the bright colors from trees and stones to redecorate the spaces and embellish their houses with, a type of abstract art, traditional Qatt Al Aseeri, which is now recognized as a global symbol that expresses man and place.", "published_at": "2024-03-21T19:24:11.794Z", "image": "destinations/imgdestination_17.jpg", "slug": "abha"}}, {"model": "core.destination", "pk": 18, "fields": {"name": "Jazan", "summary": "Jazan is characterized by a stunning geographic, environmental, and cultural diversity. As soon as you embark on a journey to explore this enchanting coastal region, which stretches for 200 kilometers along the Red Sea coast, you will discover exciting experiences, ranging from scuba diving to climbing Al Qahr and Fifa Mountains. The region is known for producing the finest tropical fruits, such as mangoes, bananas, papayas, and figs. Jazan allows you to enjoy the breathtaking nature on Farasan Islands, which are registered in the UNESCO Man and the Biosphere Program. The region also includes historical monuments that date back to 8,000 BC, in addition to a number of promising industrial projects. Jazan has multiple dimensions of life, where modern life coexists with traditional villages that are rich in authentic traditions.", "published_at": "2024-03-21T19:19:19.224Z", "image": "destinations/imgdestination_None_2l0ZpPW.jpg", "slug": "jazan"}}, {"model": "core.destination", "pk": 19, "fields": {"name": "Al Namas", "summary": "At the top of the Sarawat Mountains, in the enchanting Aseer Province, Al Namas offers visitors one of the most beautiful experiences and trips amidst captivating nature. The climate in Al Namas is characterized by refreshing rains, fog, and cool temperatures for most of the year, and its natural terrain, green vegetation, and delicious seasonal crops combine to create a stunning destination for nature lovers and enthusiasts of unique experiences. Al Namas is known for its peaceful rural life in villages, and its simple people who work in traditional professions such as agriculture and animal husbandry. Visitors to the highlands of Al Namas can engage in enjoyable activities such as mountain climbing and camping in the forests, as well as visiting parks.", "published_at": "2024-03-21T19:20:11.598Z", "image": "destinations/imgdestination_None_sZnWuxF.jpg", "slug": "al-namas"}}, {"model": "core.destination", "pk": 20, "fields": {"name": "Al Jubail", "summary": "stunning beaches, vast green parks, modern commercial complexes, and luxurious restaurants offering delicious dishes with colourful sea views. Al Jubail is one of the world's largest industrial cities, with several industrial complexes for petrochemical, primary, and secondary industries owned by the Saudi company SABIC. The history of this fascinating coastal city dates back to 1910. It also reveals historical sites and archaeological landmarks and includes Al Jubail Port, one of the most famous ports in Saudi Arabia, known since ancient times as one of the most important centres for pearl extraction. Al Jubail is also one of the most important recreational destinations, with its elegant streets adorned with shrubs, and the Gulf waters revealing exciting activities such as swimming, diving, and fishing. Its green gardens and beautiful parks encourage living moments of fun to create the most beautiful memories.", "published_at": "2024-03-21T19:20:52.209Z", "image": "destinations/imgdestination_None_6zwmOi7.jpg", "slug": "al-jubail"}}, {"model": "core.destination", "pk": 21, "fields": {"name": "Najran", "summary": "On the southern banks of the largest desert in the Kingdom lies the region of Najran, land of culture, heritage, ancient civilizations, and geographic diversity. Najran takes you on a journey through history, encompassing the Hima Cultural Area, registered on the UNESCO World Heritage List, which contains inscriptions and artifacts left by humans throughout the ages on one of the oldest caravan routes in Najran. The region then leads you to explore the history in its desert inscriptions and artifacts, which offer glimpses into its rich past and the details of human life over the ages. Between oases, mountains, and deserts, Najran captivates you with its fertile soil, fresh water, and moderate climate for most of the year. All these factors have enabled the region to provide the Kingdom with the bounty of its agricultural land, especially citrus fruits that have thrived since 1982. Its abundant palm trees produce luxurious dates, including the Baiadh and Al-Muwakal varieties.", "published_at": "2024-03-21T19:21:41.261Z", "image": "destinations/imgdestination_None_aHcOxKA.jpg", "slug": "najran"}}, {"model": "core.destination", "pk": 23, "fields": {"name": "The Red Sea", "summary": "The Red Sea destination is a pristine area within an eight-hour flight from 80% of the world's population. It features stunning beaches, volcanos, desert dunes, canyons, historical sites, and 90 untouched islands surrounded by a massive barrier reef system. With sustainability as a priority, the destination aims to have a positive impact on the environment, society, and economy. Key initiatives include preserving 75% of the islands, banning single-use plastics, and operating with zero waste and carbon emissions. The Red Sea destination offers exceptional accessibility, dining, adventure, and entertainment for unforgettable experiences.", "published_at": "2024-04-25T17:28:18.746Z", "image": "destinations/imgdestination_None_JoTgNlE.jpg", "slug": "the-red-sea"}}, {"model": "core.comment", "pk": 1, "fields": {"destination": 1, "username": "Hoba", "body": "beautiful city", "date_added": "2024-03-14T15:14:08.401Z"}}, {"model": "core.site", "pk": 1, "fields": {"name": "Al Masmak Palace", "summary": "The magnificent Al Masmak Palace stands erected gracefully in the middle of Riyadh city as a tourist destination having silently witnessed great events in the history of KSA foundation.\r\n\r\nThe palace was constructed in the hijri 14th century during the reign of Imam Abdullah bin Faisal as his residence and the center of power and money. The palace is a strong fort against enemies with its solid high walls. It has only two entrances and small openings in the walls for gun barrels at the time of battles. Today, the palace stands as a symbol of the history of regaining power and rule of the country displaying in its corridors the features of that era and its leaders after it had been turned into a museum in 1995/1416.\r\n\r\nThe Arabic word Al Masmak means a strong thick building that had been once used as a depot for weapons and ammunitions until it was turned into a historic milestone then a museum.", "image": "sites/imgsites_None.jpg", "location": "locations/imglocations_1.png", "destination": 2, "slug": "al-masmak-palace", "map_link": "https://maps.app.goo.gl/48VT4BasDgv1stNK9"}}, {"model": "core.site", "pk": 2, "fields": {"name": "AL MURABBA PALACE", "summary": "A real treat for history enthusiasts, Al Murabba Palace is one of the most prominent historical monuments of Riyadh. Built in the traditional Najdean style, this palace has witnessed the important stages in the history of the Kingdom. The former home of King Abdul Aziz, it has also hosted many kings and presidents from other countries.", "image": "sites/imgsites_None_hRsnePN.jpg", "location": "locations/imglocations_None_qfGqvFZ.jpg", "destination": 2, "slug": "al-murabba-palace", "map_link": "https://maps.app.goo.gl/VtMe8G8Wn4dLGBHd6"}}, {"model": "core.site", "pk": 3, "fields": {"name": "ELEPHANT ROCK", "summary": "Resembling an elephant with its trunk touching the ground, Elephant Rock is a large sandstone monolith that is considered one of the iconic landmarks of AlUla. Standing at a height of 52 meters upon golden sands, with mountains looming in the background, this historical landmark is best visited during sunset when you can enjoy breezy weather and breathtaking views.", "image": "sites/imgsites_None_OwtCNrh.jpg", "location": "locations/imglocations_None_OoAPPA9.jpg", "destination": 1, "slug": "elephant-rock", "map_link": "https://maps.app.goo.gl/zJkm8kZrSraTxxWN8"}}, {"model": "core.site", "pk": 4, "fields": {"name": "AL BAYDAA PARK", "summary": "Al Baydaa Park is considered the perfect destination for campers and nature lovers in Madinah. Located northwest of Madinah, this park attracts visitors from all over Saudi Arabia. Wildlife enthusiasts can pitch tents, set bonfires and enjoy a unique camping experience along with hiking and climbing trails suitable for all family members.", "image": "sites/imgsites_None_lhGHHQl.jpg", "location": "locations/imglocations_None_wzEXyob.jpg", "destination": 9, "slug": "al-baydaa-park", "map_link": "https://maps.app.goo.gl/36PQNEuxmmVM7UoH6"}}, {"model": "core.site", "pk": 5, "fields": {"name": "ITHRA", "summary": "Step into a world of outstanding creativity! Offering an unparalleled experience, this cultural centre resembles a space station. With a cinema, a museum, exhibition galleries, a library, and a theatre with world-class performing arts, Ithra is guaranteed to overwhelm you. This attraction is a 15-minute drive from Dammam.", "image": "sites/imgsites_None.jpeg", "location": "locations/imglocations_None_hFJ3IJF.jpg", "destination": 12, "slug": "ithra", "map_link": "https://maps.app.goo.gl/Y63wLyCVYsUnUD4Z9"}}, {"model": "core.event", "pk": 1, "fields": {"name": "Telescope experience - Jeddah", "description": "Beit Nassif\r\nPrepare to embark on a celestial journey that combines spirituality, astronomy, and community as you gaze at the moon through telescopes during Ramadan where a professional astronomer takes you through it! Let this experience ignite your curiosity, deepen your connection with the cosmos, and enrich your Ramadan observances like never before", "image": "events/imgevents_None.png", "price": 100, "published_at": "2024-03-11T18:00:00Z", "destination": 3, "ticket_link": "https://maps.app.goo.gl/y6wnsJ8Jo5sqn5RZA", "slug": "telescope-experience-jeddah"}}, {"model": "core.event", "pk": 2, "fields": {"name": "Workshops Manara Art - Dammam", "description": "Waterfront\r\nInteractive artistic workshops blending arts and crafts, reflecting aspects of Saudi culture and heritage. The workshops are conducted by craftsmen and specialists in different fields.", "image": "events/imgevents_None.jpg", "price": 100, "published_at": "2024-02-06T18:00:00Z", "destination": 12, "ticket_link": "https://maps.app.goo.gl/w8jDDm8j6ueVVPfh9", "slug": "workshops-manara-art-dammam"}}, {"model": "core.event", "pk": 3, "fields": {"name": "Zarqaa Al Yamama Opera", "description": "King Fahad Cultural Center\r\nZarqa Al Yamama represents the first Saudi grand opera to feature international and locally trained artists performing a libretto composed exclusively in Arabic. Based on an ancient tale from pre-Islamic Arabia, Zarqa Al Yamama tells the story of a legendary woman, born of the Geddes tribe and blessed with the gift of foresight. After foreseeing an attack by a rival army that threatens to destroy her people, the story follows the eponymous heroine as she tries to warn her leader and his advisors of the imminent danger. The original musical score, written and composed by Lee Bradshaw, and libretto were developed from an original adaptation of the mythos by acclaimed Saudi writer and poet Saleh Zamanan. Featuring a stunning lineup of international and Saudi talent, the opera promises to unveil the dramatic narrative through a spectacular state-of-the-art production, filled with sweeping orchestral and choral sections, delicate moments of beauty", "image": "events/imgevents_None_fDKh2Hp.jpg", "price": 100, "published_at": "2024-01-22T00:00:00Z", "destination": 2, "ticket_link": "https://dc.moc.gov.sa/home/ar/event-tickets/208/zarqaa-al-yamama-opera/", "slug": "zarqaa-al-yamama-opera"}}]